{
  "backend/main.mo": "Motoko actor defining a Question type and a large static array of reflexology quiz questions in Malay, with a comparator function for sorting by topic and text.",
  "feature_evidence.json": "Feature evidence report mapping three product features (interactive quiz, visual theme, topic filter) to their implementing frontend files and test IDs.",
  "frontend-file-summaries.txt": "JSON document providing one-line descriptions of each frontend source file, serving as a quick reference for the project's frontend structure.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the React app titled 'Kuiz Interaktif Refleksologi', mounting the app into a root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with two routes: home ('/') rendering HomePage and quiz ('/quiz') rendering QuizPage.",
  "frontend/src/components/QuestionCard.tsx": "Displays a single quiz question with four labeled answer buttons, applies correct/incorrect visual styles after selection, and shows an explanation toggle plus a next/finish button.",
  "frontend/src/components/QuizSummary.tsx": "End-of-quiz summary component showing a star rating, score circle, percentage badge, and score breakdown grid, with restart and home action buttons.",
  "frontend/src/components/TopicSelector.tsx": "Renders a grid of selectable topic cards plus a 'Full Quiz' card, each showing question counts and styled with rotating color gradients.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exports two React Query hooks—useAllQuestions and useQuestionsByTopic—that fetch quiz questions from the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, defines Tailwind CSS layers with a warm OKLCH color palette (light/dark), and adds utility classes and keyframe animations for the quiz UI.",
  "frontend/src/lib/utils.ts": "Exports a cn utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying a header, hero banner, and TopicSelector grid; fetches all questions to derive topics and navigates to the quiz page on selection.",
  "frontend/src/pages/QuizPage.tsx": "Quiz page that shuffles and presents questions one at a time with progress tracking, records answers, and shows a summary screen with score on completion.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Plus Jakarta Sans, Lora), OKLCH-based color tokens, border radii, box shadows, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Project state tracking file describing an interactive reflexology quiz app (Kaki, Tangan, Telinga topics) with MCQ questions, scoring, and UI features. Records schema version, existing features, known issues, new feature requests, and image requirements."
}