{
  "backend/main.mo": "Motoko actor defining the quiz backend with Question and Result types, a hardcoded question bank grouped by topic, and a results map with an incrementing ID for storing participant quiz scores.",
  "feature_evidence.json": "Feature evidence report mapping a single rebuild/redeploy feature to its relevant frontend files, UI components, and test ID REQ-16.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries for each frontend source file, serving as a reference index for the project's frontend structure.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including background, foreground, primary, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Kuiz Interaktif Refleksologi' that mounts the React app into a root div via the main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with three routes: home (/), quiz (/quiz), and admin (/admin), each mapped to their respective page components.",
  "frontend/src/components/ParticipantForm.tsx": "Form component that collects a participant's full name and date with validation, enabling the start button only when both fields are filled.",
  "frontend/src/components/QuestionCard.tsx": "Displays a single quiz question with four labeled answer options, applying correct/incorrect visual styles after selection and toggling an explanation panel.",
  "frontend/src/components/QuizSummary.tsx": "Results summary component showing participant info, star rating, score percentage, performance label with message, and a per-question answer breakdown table.",
  "frontend/src/components/TopicSelector.tsx": "Renders a grid of selectable topic cards plus a 'Full Quiz' card, each showing question counts and styled with gradient colors. Calls `onSelect` with the chosen topic or null for the full quiz.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing Internet Identity authentication, including login, logout, and persisted identity state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports three React Query hooks—`useAllQuestions`, `useQuestionsByTopic`, and `useResults`—that fetch data from the ICP backend actor with caching.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, defines Tailwind CSS layers with a warm OKLCH-based design token palette (light and dark modes), custom utility classes for quiz answer states, and print styles.",
  "frontend/src/lib/utils.ts": "Exports a `cn` utility function that merges Tailwind CSS class names using `clsx` and `tailwind-merge`.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrapping the root `App` component.",
  "frontend/src/pages/AdminPage.tsx": "Admin page displaying a ranked leaderboard table of quiz results with rank icons, performance badges, and a printable per-participant result card component.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero banner, topic selector grid, and navigation to the quiz route; fetches all questions to derive available topics and their counts.",
  "frontend/src/pages/QuizPage.tsx": "Main quiz page component that handles participant info collection, shuffles and displays questions one at a time, tracks answers, calculates scores, submits results to the backend actor, and renders summary on completion with restart capability.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts, OKLCH-based color tokens, border radii, box shadows, and keyframe animations for the frontend design system.",
  "project_state.json": "Project state metadata file tracking version, feature list, architectural notes, and known issues for a reflexology quiz web application with MCQ questions, topic categories, scoring, and an admin leaderboard."
}