{
  "backend/main.mo": "Motoko actor defining Question and Result types, a hardcoded question bank, and backend logic for storing/retrieving quiz results mapped by ID.",
  "feature_evidence.json": "Feature evidence report mapping three print-related feature IDs to their target files (QuizSummary.tsx, AdminPage.tsx, index.css) with associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries for each frontend source file, describing their roles in the quiz application.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes used throughout the UI.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with three routes: home (/), quiz (/quiz), and admin (/admin).",
  "frontend/src/components/ParticipantForm.tsx": "Pre-quiz form component collecting participant name and date, with a submit button disabled until both fields are filled.",
  "frontend/src/components/QuestionCard.tsx": "Displays a single quiz question with four answer buttons, correct/incorrect visual feedback, an explanation toggle, and next/finish navigation.",
  "frontend/src/components/QuizSummary.tsx": "Displays the quiz results summary including participant info, star rating, score percentage, performance label, and a per-question answer review with correct/incorrect indicators.",
  "frontend/src/components/TopicSelector.tsx": "Renders a grid of selectable topic cards (plus a 'full quiz' card) with question counts, allowing the user to pick a specific topic or all topics.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all questions, questions by topic, and quiz results from the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, defines Tailwind CSS layers with a warm health-inspired OKLCH color palette (light/dark), custom utility classes for answer states, animations, and print styles.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that displays a ranked leaderboard of quiz results with participant details, performance badges, and a printable result card component for individual participants.",
  "frontend/src/pages/HomePage.tsx": "Landing page that displays a hero banner, topic selector, and header with admin navigation. Fetches all questions to derive available topics and routes users to the quiz page with an optional topic filter.",
  "frontend/src/pages/QuizPage.tsx": "Main quiz page that handles participant info collection, shuffled question presentation, answer tracking, scoring, and result submission to the backend. Renders ParticipantForm, QuestionCard, and QuizSummary components based on quiz state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and keyframe animations for the application's design system.",
  "project_state.json": "Project state metadata file tracking version, feature list, architectural notes, and known issues for a reflexology interactive quiz application with MCQ questions, topic categories, scoring, and an admin leaderboard."
}